Reports/Renault_АвтосервисОтчетность_ЗНСЗаявками_Расшифровка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>Renault_АвтосервисОтчетность_ЗНСЗаявками_Расшифровка</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/Renault_СоответствияВидовРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_СоответствияВидовРемонта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлассификацияRenault</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_КлассификацияВидовРемонта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипРаботVOC</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_КлассификацияВидовРемонта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/Renault_КлассификацияВидовРемонта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>Renault_КлассификацияВидовРемонта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СлесарныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярноеТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегулярноеТОИСлесарныйРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мойка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительноеОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантияСлесарныйРемонт</Name>
					<Comment>Гарантия слесарный ремонт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГарантияКузовнойЦех</Name>
					<Comment>Гарантия кузовной ремонт</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КузовнойРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнутреннийРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисныеПродукты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Renault_ОбщиеНастройкиБазыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_ОбщиеНастройкиБазыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автосклад_ПодтверждатьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PCLПродажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PNCЗакупСкладская</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PNCЗакупСрочная</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосервис_ААА_ВыгружатьДанныеПоКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосервис_ААА_ПериодВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосервис_ПутьААА</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог_Renault</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосклад_НеУчитыватьРеализацииКакВыдачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПланшетECP</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОпределениеДЦВЗН</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосервис_ШаблонМонитора_ЗаголовокПусто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосервис_ШаблонМонитора_Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОптоваяЦена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьМодифицированныйФункционалВыдачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСкладРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользоватьПроверкуФИО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомерАвтоТолькоЛатиницей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьФотоВФайловойСистеме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневойКаталогФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автосклад_ЦеныАМПрежнихГодовСчитатьПоПоследнемуТарифу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтатусыВМониторЗаписи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ВидыСостоянийДокументовАвтосервиса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаСтатуса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/Renault_АвтосервисОтчетность_ЗНСЗаявками_Расшифровка/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ОпределениеДЦВЗН = Справочники.Renault_ОбщиеНастройкиБазыДанных.ЭтаБаза.ОпределениеДЦВЗН;
	
	Если ОпределениеДЦВЗН = 0 Тогда
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ДЦПодразделения.Подразделение КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.ПодразделенияОрганизации КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.ПодразделениеКомпании = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ
		|	И ПодразделенияЦеха.ДилерскийЦентр = &ДЦ";
	Иначе
		СтрокаДляЗамены = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДЦПодразделения.Ссылка КАК ДилерскийЦентр,
		|	ВЫБОР КОГДА ДЦПодразделения.Цех.Родитель = ЗНАЧЕНИЕ(Справочник.Цеха.ПустаяСсылка) ТОГДА
		|		ДЦПодразделения.Цех
		|	ИНАЧЕ
		|		ДЦПодразделения.Цех.Родитель
		|	КОНЕЦ КАК ПодразделениеЦех
		|ПОМЕСТИТЬ ПодразделенияЦеха
		|ИЗ Справочник.CRM_ДилерскиеЦентры.АвтосервисЦеха КАК ДЦПодразделения
		|;
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
		|	ПодразделенияЦеха.ДилерскийЦентр КАК ДилерскийЦентр
		|ПОМЕСТИТЬ ВсеЗНСРаботами
		|ИЗ
		|	Документ.ЗаказНаряд.Работы КАК Работы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПодразделенияЦеха КАК ПодразделенияЦеха
		|		ПО Работы.Ссылка.Цех = ПодразделенияЦеха.ПодразделениеЦех
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Renault_СоответствияВидовРемонта КАК Renault_СоответствияВидовРемонта
		|		ПО Renault_СоответствияВидовРемонта.ВидРемонта = Работы.Ссылка.ВидРемонта
		|		И (Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.КузовнойРемонт)
		|			ИЛИ Renault_СоответствияВидовРемонта.КлассификацияRenault = ЗНАЧЕНИЕ(Перечисление.Renault_КлассификацияВидовРемонта.ГарантияКузовнойЦех))
		|ГДЕ
		|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
		|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
		|	И Renault_СоответствияВидовРемонта.ВидРемонта ЕСТЬ NULL 
		|	И ПодразделенияЦеха.ДилерскийЦентр.ПометкаУдаления = ЛОЖЬ
		|	И ПодразделенияЦеха.ДилерскийЦентр = &ДЦ";
	КонецЕсли;
	
	СтрокаПоиска = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВЫРАЗИТЬ(Работы.Ссылка КАК Документ.ЗаказНаряд) КАК СсылкаЗН,
	|	ДЦ.Ссылка КАК ДилерскийЦентр
	|ПОМЕСТИТЬ ВсеЗНСРаботами
	|ИЗ
	|	Документ.ЗаказНаряд.Работы КАК Работы
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.CRM_ДилерскиеЦентры КАК ДЦ
	|	ПО ЛОЖЬ
	|ГДЕ
	|	Работы.Ссылка.ДатаЗакрытия >= &ДатаНачала
	|	И Работы.Ссылка.ДатаЗакрытия < &ДатаОкончания
	|	И ДЦ.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ДЦ.Ссылка = &ДЦ";
	
	СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос = СтрЗаменить(СхемаКомпоновкиДанных.НаборыДанных.НаборДанных1.Запрос, СтрокаПоиска, СтрокаДляЗамены);
	
КонецПроцедуры
